EDT/УТ/src/Documents/КорректировкаСтатусовСкладскогоУчета_КУдалению/КорректировкаСтатусовСкладскогоУчета_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаСтатусовСкладскогоУчета_КУдалению</name>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыСкладскогоУчета/СтатусыСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСкладскогоУчета</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ДанныеЗаказаВодителя/ДанныеЗаказаВодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеЗаказаВодителя</name>
  <registerRecords>InformationRegister.ОперативныеСтатусыЗаказовПоДаннымМП</registerRecords>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеВыполненияДоставки</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодъема</name>
    <type>
      <types>EnumRef.ВидыПодъемовВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторовЗапросаСостоянияЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЧекаНаПечать</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечатиЧеков</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаФормированияЧекаНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВозвратногоЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыЧек</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХодокНаЭтаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РассчитаннаяСтоимостьПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнесеннаяСтоимостьПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесРасчетаПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БрейкРасчетаПодъема</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесРасчетаПодъемаВыгруженный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУстановленБезКИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтИМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтоимостьДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченаСтоимостьДоставкиПриОтменеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМП</name>
    <type>
      <types>CatalogRef.НомераВерсийМП</types>
    </type>
  </attributes>
  <attributes>
    <name>БылаПримерка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоSKUПримерки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратНаДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоставленныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНоменклатуры</name>
      <type>
        <types>CatalogRef.ШтрихкодыТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтказныеЭкземплярыТоваров</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/СтатусыСкладскогоУчета/СтатусыСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыСкладскогоУчета</name>
  <predefined>
    <items>
      <name>Возврат1</name>
      <description>Возврат 1</description>
    </items>
    <items>
      <name>Возврат2</name>
      <description>Возврат 2</description>
    </items>
    <items>
      <name>ВозвратОтправлен</name>
      <description>Возврат отправлен</description>
    </items>
    <items>
      <name>ВозвратПринятМагазином</name>
      <description>Возврат принят магазином</description>
    </items>
    <items>
      <name>ЗаказВернулсяСРегионаНаТерминалПриемки</name>
      <description>Заказ вернулся с региона на терминал приемки</description>
    </items>
    <items>
      <name>ЗаказВыполнен</name>
      <description>Заказ выполнен</description>
    </items>
    <items>
      <name>ЗаказНеВозвратный</name>
      <description>Заказ не возвратный</description>
    </items>
    <items>
      <name>ОтменаСтатуса</name>
      <description>Отмена статуса</description>
    </items>
    <items>
      <name>ПодготовленКВозврату</name>
      <description>Подготовлен к возврату</description>
    </items>
    <items>
      <name>ПриходЕстьНаСканере</name>
      <description>Приход есть на сканере</description>
    </items>
    <items>
      <name>ПриходПодтвержден</name>
      <description>Приход подтвержден</description>
    </items>
    <items>
      <name>ПриходПодтвержденПриходнымДокументом</name>
      <description>Приход подтвержден приходным документом</description>
    </items>
    <items>
      <name>ПриходПроверен</name>
      <description>Приход проверен</description>
    </items>
    <items>
      <name>УчтеноРасхождение</name>
      <description>Учтено расхождение</description>
    </items>
  </predefined>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/КорректировкаСтатусовСкладскогоУчета_КУдалению/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоПустымУслугам(Команда)
    ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация КАК Заказ
        |ИЗ
        |   Документ.ДанныеЗаказаВодителя.ДоставленныеТовары КАК ДанныеЗаказаВодителяДоставленныеТовары
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСкладскогоУчета КАК СтатусыСкладскогоУчета
        |       ПО ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация = СтатусыСкладскогоУчета.Заказ
        |           И (СтатусыСкладскогоУчета.СтатусСкладскогоУчета В (&СтатусыСкладскогоУчета))
        |ГДЕ
        |   ДанныеЗаказаВодителяДоставленныеТовары.Номенклатура.Артикул В
        |           (ВЫБРАТЬ
        |               УслугиПоЗаказам.Артикул
        |           ИЗ
        |               Справочник.УслугиПоЗаказам КАК УслугиПоЗаказам
        |           ГДЕ
        |               НЕ УслугиПоЗаказам.ПометкаУдаления)
        |   И ДанныеЗаказаВодителяДоставленныеТовары.КоличествоДоставлено = 0
        |
        |СГРУППИРОВАТЬ ПО
        |   ДанныеЗаказаВодителяДоставленныеТовары.Ссылка.Реализация";
        
    СтатусыСкладскогоУчета = Новый СписокЗначений;
    СтатусыСкладскогоУчета.Добавить(Справочники.СтатусыСкладскогоУчета.Возврат1);
    СтатусыСкладскогоУчета.Добавить(Справочники.СтатусыСкладскогоУчета.Возврат2);
    Запрос.УстановитьПараметр("СтатусыСкладскогоУчета", СтатусыСкладскогоУчета);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        СтрокаТЧ = Объект.Заказы.Добавить();
        СтрокаТЧ.Заказ = ВыборкаДетальныеЗаписи.Заказ;
        ТипЗаказа = smv.ПолучитьТипЗаказа(ВыборкаДетальныеЗаписи.Заказ);
        СтрокаТЧ.ТипЗаказа = ТипЗаказа;
    КонецЦикла;

КонецПроцедуры
